###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.files will be created
  + resource "aws_route53_record" "files" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "files.imichka.me"
      + records         = [
          + "13.37.74.228",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z05358081KTIZBSCHQM87"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Production`*